import common

debugVersion = 0
if debugVersion == 0:

    for i in range(-1000, 1000):
        dump = common.entry(returnType="int",failureMsg=("debug failure (target 000) -> '" + str(i) + "'"), debugValue=i) #target 000
        if dump == "debugError":
            print("error for (target 000) -> '"+ str(i)+ "'")

    charTab = ['',' ','á','Ã¡','À','Ã€','ä','Ã¤','Ä','Ã„','ã','Ã£','å','Ã¥','Å','Ã…','æ','Ã¦','Æ','Ã†','ç','Ã§','Ç','Ã‡','é','Ã©','É','Ã‰','è','Ã¨','È','Ãˆ','ê','Ãª','Ê','ÃŠ','ë','Ã«','Ë','Ã‹','í','Ã-­­','Í','Ã','ì','Ã¬','Ì','ÃŒ','î','Ã®','Î','ÃŽ','ï','Ã¯','Ï','Ã','ñ','Ã±','Ñ','Ã‘','ó','Ã³','Ó','Ã“','ò','Ã²','Ò','Ã’','ô','Ã´','Ô','Ã”','ö','Ã¶','Ö','Ã–','õ','Ãµ','Õ','Ã•','ø','Ã¸','Ø','Ã˜','œ','Å“','Œ','Å’','ß','ÃŸ','ú','Ãº','Ú','Ãš','ù','Ã¹','Ù','Ã™','û','Ã»','Û','Ã›','ü','Ã¼','Ü','Ãœ','€','â‚¬','’','â€™','‚','â€š','ƒ','Æ’','„','â€ž','…','â€¦','‡','â€¡','ˆ','Ë†','‰','â€°','Š','Å ','‹','â€¹','Ž','Å½','‘','â€˜','“','â€œ','•','â€¢','–','â€“','—','â€”','˜','Ëœ','™','â„¢','š','Å¡','›','â€º','ž','Å¾','Ÿ','Å¸','¡','Â¡','¢','Â¢','£','Â£','¤','Â¤','¥','Â¥','¦','Â¦','§','Â§','¨','Â¨','©','Â©','ª','Âª','«','Â«','¬','Â¬','®','Â®','¯','Â¯','°','Â°','±','Â±','²','Â²','³','Â³','´','Â´','µ','Âµ','¶','Â¶','·','Â·','¸','Â¸','¹','Â¹','º','Âº','»','Â»','¼','Â¼','½','Â½','¾','Â¾','¿','Â¿','à','Ã ','†','â€ ','”','â€','Á','Ã','â','Ã¢','Â','Ã‚','Ã','Ãƒ',]
    for char in charTab:
        dump = common.entry(returnType="str",failureMsg=("debug failure (target 100) -> '" + str(char) + "'"), debugValue=char) #target 100
        if dump == "debugError":
            print("error for (target 100) -> '"+ char+ "'")

    boolTab = ["yes", "y", "Y", "no", "n", "N", "", " ", "oui", "non", "Oui", "Non"]
    for char in boolTab:
        dump = common.entry(returnType="bool", failureMsg=("debug failure (target 200) -> '" + str(char) + "'"), debugValue=char) #target 200
        if dump == "debugError":
            print("error for (target 200) -> '"+ char+ "'")
    
